{
  "transform_params" : {
    "input" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 1
    }
  },
  "properties" : {

  },
  "storage" : "model.espresso.weights",
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "260",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "name" : "260",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 3,
      "bottom" : "input",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "263",
      "blob_weights" : 7,
      "K" : 3,
      "blob_biases" : 5,
      "stride_x" : 2,
      "name" : "261",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "260",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "266",
      "blob_weights" : 11,
      "K" : 16,
      "blob_biases" : 9,
      "stride_x" : 2,
      "name" : "264",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "263",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "269",
      "blob_weights" : 15,
      "K" : 64,
      "blob_biases" : 13,
      "name" : "267",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "266",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "272",
      "blob_weights" : 19,
      "K" : 64,
      "blob_biases" : 17,
      "name" : "270",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "269",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "275",
      "blob_weights" : 23,
      "K" : 64,
      "blob_biases" : 21,
      "name" : "273",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "272",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "277",
      "blob_weights" : 27,
      "K" : 64,
      "blob_biases" : 25,
      "name" : "276",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "275",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "277,266",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "278",
      "type" : "elementwise",
      "name" : "278",
      "beta" : 0
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "279",
      "type" : "activation",
      "name" : "279",
      "bottom" : "278"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "282",
      "blob_weights" : 31,
      "K" : 64,
      "blob_biases" : 29,
      "name" : "280",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "279",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "285",
      "blob_weights" : 35,
      "K" : 64,
      "blob_biases" : 33,
      "name" : "283",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "282",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "288",
      "blob_weights" : 39,
      "K" : 64,
      "blob_biases" : 37,
      "name" : "286",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "285",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "290",
      "blob_weights" : 43,
      "K" : 64,
      "blob_biases" : 41,
      "name" : "289",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "288",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "290,279",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "291",
      "type" : "elementwise",
      "name" : "291",
      "beta" : 0
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "292",
      "type" : "activation",
      "name" : "292",
      "bottom" : "291"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "295",
      "blob_weights" : 47,
      "K" : 64,
      "blob_biases" : 45,
      "name" : "293",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "292",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "298",
      "blob_weights" : 51,
      "K" : 64,
      "blob_biases" : 49,
      "name" : "296",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "295",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "301",
      "blob_weights" : 55,
      "K" : 64,
      "blob_biases" : 53,
      "name" : "299",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "298",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "303",
      "blob_weights" : 59,
      "K" : 64,
      "blob_biases" : 57,
      "name" : "302",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "301",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "303,292",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "304",
      "type" : "elementwise",
      "name" : "304",
      "beta" : 0
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "305",
      "type" : "activation",
      "name" : "305",
      "bottom" : "304"
    },
    {
      "pad_value" : 0,
      "top" : "306",
      "pad_pad_mode" : 0,
      "pad_t" : 0,
      "pad_r" : 0,
      "pad_b" : 0,
      "type" : "general_padding",
      "pad_fill_mode" : 0,
      "bottom" : "305",
      "pad_l" : 0,
      "name" : "306",
      "weights" : {

      }
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 0,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "306",
      "pad_l" : 0,
      "name" : "307",
      "top" : "307"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "309",
      "blob_weights" : 63,
      "K" : 64,
      "blob_biases" : 61,
      "name" : "308",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "307",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "top" : "312",
      "blob_weights" : 67,
      "K" : 64,
      "blob_biases" : 65,
      "name" : "310",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "309",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "315",
      "blob_weights" : 71,
      "K" : 64,
      "blob_biases" : 69,
      "name" : "313",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "312",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 2,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 2
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "317",
      "blob_weights" : 75,
      "K" : 64,
      "blob_biases" : 73,
      "name" : "316",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "315",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "317,307",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "318",
      "type" : "elementwise",
      "name" : "318",
      "beta" : 0
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "319",
      "type" : "activation",
      "name" : "319",
      "bottom" : "318"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "321",
      "blob_weights" : 79,
      "K" : 64,
      "blob_biases" : 77,
      "name" : "320",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "319",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "top" : "324",
      "blob_weights" : 83,
      "K" : 64,
      "blob_biases" : 81,
      "name" : "322",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "321",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 4,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 4,
      "top" : "327",
      "blob_weights" : 87,
      "K" : 64,
      "blob_biases" : 85,
      "name" : "325",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 4,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "324",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 4
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "329",
      "blob_weights" : 91,
      "K" : 64,
      "blob_biases" : 89,
      "name" : "328",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "327",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "329,319",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "330",
      "type" : "elementwise",
      "name" : "330",
      "beta" : 0
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "331",
      "type" : "activation",
      "name" : "331",
      "bottom" : "330"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "333",
      "blob_weights" : 95,
      "K" : 64,
      "blob_biases" : 93,
      "name" : "332",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "331",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "top" : "336",
      "blob_weights" : 99,
      "K" : 64,
      "blob_biases" : 97,
      "name" : "334",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "333",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 8,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 8,
      "pad_l" : 8,
      "top" : "339",
      "blob_weights" : 103,
      "K" : 64,
      "blob_biases" : 101,
      "name" : "337",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 8,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "336",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 8,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 8
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "341",
      "blob_weights" : 107,
      "K" : 64,
      "blob_biases" : 105,
      "name" : "340",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "339",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "341,331",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "342",
      "type" : "elementwise",
      "name" : "342",
      "beta" : 0
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "343",
      "type" : "activation",
      "name" : "343",
      "bottom" : "342"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "345",
      "blob_weights" : 111,
      "K" : 64,
      "blob_biases" : 109,
      "name" : "344",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "343",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "top" : "348",
      "blob_weights" : 115,
      "K" : 64,
      "blob_biases" : 113,
      "name" : "346",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "345",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 16,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 16,
      "pad_l" : 16,
      "top" : "351",
      "blob_weights" : 119,
      "K" : 64,
      "blob_biases" : 117,
      "name" : "349",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 16,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "348",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 16,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 16
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "353",
      "blob_weights" : 123,
      "K" : 64,
      "blob_biases" : 121,
      "name" : "352",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "351",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "353,343",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "354",
      "type" : "elementwise",
      "name" : "354",
      "beta" : 0
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "355",
      "type" : "activation",
      "name" : "355",
      "bottom" : "354"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "357",
      "blob_weights" : 127,
      "K" : 64,
      "blob_biases" : 125,
      "name" : "356",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "355",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "top" : "360",
      "blob_weights" : 131,
      "K" : 64,
      "blob_biases" : 129,
      "name" : "358",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "357",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "363",
      "blob_weights" : 135,
      "K" : 64,
      "blob_biases" : 133,
      "name" : "361",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "360",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 2,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 2
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "365",
      "blob_weights" : 139,
      "K" : 64,
      "blob_biases" : 137,
      "name" : "364",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "363",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "365,355",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "366",
      "type" : "elementwise",
      "name" : "366",
      "beta" : 0
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "367",
      "type" : "activation",
      "name" : "367",
      "bottom" : "366"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "369",
      "blob_weights" : 143,
      "K" : 64,
      "blob_biases" : 141,
      "name" : "368",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "367",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "top" : "372",
      "blob_weights" : 147,
      "K" : 64,
      "blob_biases" : 145,
      "name" : "370",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "369",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 4,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 4,
      "top" : "375",
      "blob_weights" : 151,
      "K" : 64,
      "blob_biases" : 149,
      "name" : "373",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 4,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "372",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 4
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "377",
      "blob_weights" : 155,
      "K" : 64,
      "blob_biases" : 153,
      "name" : "376",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "375",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "377,367",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "378",
      "type" : "elementwise",
      "name" : "378",
      "beta" : 0
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "379",
      "type" : "activation",
      "name" : "379",
      "bottom" : "378"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "381",
      "blob_weights" : 159,
      "K" : 64,
      "blob_biases" : 157,
      "name" : "380",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "379",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "top" : "384",
      "blob_weights" : 163,
      "K" : 64,
      "blob_biases" : 161,
      "name" : "382",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "381",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 8,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 8,
      "pad_l" : 8,
      "top" : "387",
      "blob_weights" : 167,
      "K" : 64,
      "blob_biases" : 165,
      "name" : "385",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 8,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "384",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 8,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 8
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "389",
      "blob_weights" : 171,
      "K" : 64,
      "blob_biases" : 169,
      "name" : "388",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "387",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "389,379",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "390",
      "type" : "elementwise",
      "name" : "390",
      "beta" : 0
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "391",
      "type" : "activation",
      "name" : "391",
      "bottom" : "390"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "393",
      "blob_weights" : 175,
      "K" : 64,
      "blob_biases" : 173,
      "name" : "392",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "391",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "top" : "396",
      "blob_weights" : 179,
      "K" : 64,
      "blob_biases" : 177,
      "name" : "394",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "393",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 16,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 16,
      "pad_l" : 16,
      "top" : "399",
      "blob_weights" : 183,
      "K" : 64,
      "blob_biases" : 181,
      "name" : "397",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 16,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "396",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 16,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 16
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "401",
      "blob_weights" : 187,
      "K" : 64,
      "blob_biases" : 185,
      "name" : "400",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "399",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "401,391",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "402",
      "type" : "elementwise",
      "name" : "402",
      "beta" : 0
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "403",
      "type" : "activation",
      "name" : "403",
      "bottom" : "402"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "404",
      "blob_weights" : 191,
      "K" : 64,
      "blob_biases" : 189,
      "name" : "404",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 2,
      "bottom" : "403",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 4,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 4,
      "top" : "405",
      "blob_weights" : 193,
      "K" : 2,
      "stride_x" : 8,
      "name" : "405",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 2,
      "pad_t" : 4,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 8,
      "has_biases" : 0,
      "C" : 2,
      "bottom" : "404",
      "weights" : {

      },
      "Nx" : 16,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 16,
      "n_parallel" : 1
    },
    {
      "C" : 2,
      "weights" : {

      },
      "top" : "output",
      "type" : "softmax",
      "name" : "output",
      "bottom" : "405"
    }
  ]
}